# Создать строку равную введенной строку без последних двух символов.

str01 = input("Enter: ")
str02 = str01[:-2]

print(str02)
