#Создать строку равную первым пяти символам введенной строки.

str01 = input("Enter: ")
#Можно [:5]
str02 = str01[0:5]

print(str02)
