# Создать строку равную третьему символу введенной строки.

str01 = input("Enter: ")
str02 = str01[2]

print(str02)
