'''Написать 12 функций по переводу:'''

'''Дюймы в сантиметры'''


def inches_to_centimeters(inches):
    cent = inches * 2.54
    return cent


a = inches_to_centimeters(54)
print(a)




